benchmarks/cospec_benchmark_results_20250515_181113_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_0_0.25_45_natural-questions_output.txt
INFO 05-15 22:15:20 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', dataset_name='natural-questions', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=20.0, logprobs=None, request_rate=45.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.25, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 100228 samples from cache from sentence-transformers/cache/sharegpt_facebook/opt-6.7b.json
Temperature:  0.25
Checking server health at http://127.0.0.1:8001/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 45.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 20.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     21947     
Benchmark duration (s):                  1200.27   
Total input tokens:                      250320    
Total generated tokens:                  2983771   
Request throughput (req/s):              18.29     
Output token throughput (tok/s):         2485.92   
Total Token throughput (tok/s):          2694.48   
---------------Time to First Token----------------
Mean TTFT (ms):                          39380.77  
Median TTFT (ms):                        41004.83  
P99 TTFT (ms):                           43045.45  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          102.27    
Median TPOT (ms):                        101.84    
P99 TPOT (ms):                           110.24    
---------------Inter-token Latency----------------
Mean ITL (ms):                           102.29    
Median ITL (ms):                         91.47     
P99 ITL (ms):                            162.58    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          53185.66  
Median E2EL (ms):                        53073.77  
P99 E2EL (ms):                           79120.02  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 488.83    
Median Token Latency (ms):               426.21    
P99 Token Latency (ms):                  1532.18   
==================================================